#!/usr/bin/perl -wT

##############################################################################
# PURPOSE: aqsserver - Serve AQS data, subsetted by date/time range,
#          variable, and longitude-latitude box, in ASCII, XDR, original,
#          NetCDF-COARDS, and NetCDF-IOAPI formats for use by other programs
#          (e.g., via wget).
#
# NOTES:   Server is WCS-compliant:
#          https://www.opengeospatial.org/standards/wcs
#          https://datafed.net/xs/OpenGIS/wcs/1.0.0/
#          and modeled after a similar webserver application:
#          https://webapps.datafed.net/ogc_EPA.wsfl
#
#          Connects to AQSMART database and creates/removes a
#          temporary file read by SiteSubset (run on local host).
#          Contact: mangus.nick@epa.gov, 919-541-5549.
#          See also aqspw script for resetting the db cws account passwords.
#          https://aqs.epa.gov/aqsweb/documents/codetables/parameters.html
#
#          Example usage:
#
#          wget -q -T 0 -O - 'https://ofmpub.epa.gov/rsig/aqsserver?\
#                    SERVICE=wcs&\
#                    VERSION=1.0.0&\
#                    REQUEST=GetCoverage&\
#                    COVERAGE=pm25&\
#                    TIME=2001-08-26T00:00:00Z/2001-08-30T23:59:59Z&\
#                    BBOX=-90,28,-80,32,0,0&\
#                    FORMAT=ascii'
#
# HISTORY: 2006/08/03, plessel.todd@epa.gov, 1-919-541-5500, TSSMS=cws
#          2007/06/11, plessel.todd@epa.gov Connect to AQSMART database.
#
# STATUS:  reviewed, tested.
##############################################################################


use strict;
package main;
$| = 1; # Turn off output buffering so messages appear in correct order.
alarm( 3600 ); # Kill process after 1 hour. Legitimate usage could be an hour!
# Restrict PATH and ENV. (But before popen, ENV is cleared!)
delete @ENV{ 'PATH', 'IFS', 'CDPATH', 'ENV', 'BASH_ENV' };


############################## TUNABLE CONSTANTS #############################


my $debugging = 0; # 1 = print debug messages to STDERR logs/error_log.

# Server where this program is installed:

my $server_path = 'https://YOUR_WEBSERVER_HOST/cgi-bin';
my $bindir      = '/rsig/current/code/bin/Linux.x86_64';
my $subsetter   = "$bindir/SiteSubset";
my $pams_subsetter = "/data/Pandora/PAMSSubset";
my $xdrconvert  = "$bindir/XDRConvert";
my $compressor  = "$bindir/gzip -c -1";

# Database-specific parameters:

my $database_env_variable = 'ORACLE_HOME';
my $database_env_value = '/usr/lib/oracle/xe/app/oracle/product/10.2.0/client';
# DB and password:
my $database =
##'DBI:Oracle:service_name=datamart.vmaqsmart1;' .
  'DBI:Oracle:service_name=thor.vmaqsmart7;' .
  'host=vmaqsmart7.rtpnc.epa.gov;port=1521';
my $database_account = 'ACCOUNT';
my $database_password = 'PASSWORD'; # UGLY Update after running aqspw.
# Contact conklin.tom@epa.gov to reset timed-out db pw.

my $temp_file_name = "/data/tmp/aqsserver_temp.$$";
my $temp2_file_name = "/data/tmp/aqsserver_temp2.$$";
my $temp3_file_name = "/data/tmp/aqsserver_temp3.$$";

my $metadata_content = '
US EPA AQS North American surface meteorology measured data accessed using RSIG.
AQS:
https://www.epa.gov/aqs
https://aqs.epa.gov/aqsweb/documents/data_mart_welcome.html
RSIG: https://www.epa.gov/rsig
';


my $metadata_content_original = '
Data processing was done using the RSIG program aqsserver to query the
AQSMart database and reorganize/reformat and filter the data.
The temporary file generated is shown below.
';


my $metadata_content_processed = '
Data processing was done using the RSIG programs aqsserver, SiteSubset and
XDRConvert.
SiteSubset and aqsserver are used to subset (by variable, lon-lat box and time
range) and reorganize/reformat and filter the data.
XDRConvert is optionally used to regrid, aggregate and reformat the data
to other file formats.
The RSIG command used to process them are shown below.
';

my $begin_date = 1980;

# Variables:

my @metadata = (
  {
    'name' => 'pams',
    'units' => '-',
    'description' => 'Photochemical Assessment Monitoring Stations (PAMS) site ids.',
  },
  {
    'name' => 'ozone',
    'units' => 'ppb',
    'description' => 'UTC hourly mean surface measured ozone concentration in part-per-billion.',
    'parameter_codes' => "'44201'",
    'offset' => '0',
    'scale' => '1000',
    'duration_code' => '1'
  },
  {
    'name' => 'ozone_8hour_average',
    'units' => 'ppb',
    'description' => 'Local hourly mean of preceeding 8 hours surface measured ozone concentration in part-per-billion.',
    'parameter_codes' => "'44201'",
    'offset' => '0',
    'scale' => '1000',
    'duration_code' => 'W'
  },
  {
    'name' => 'ozone_daily_8hour_maximum',
    'units' => 'ppb',
    'description' => 'Local daily maximum of 8 hour means surface measured ozone concentration in part-per-billion.',
    'parameter_codes' => "'44201'",
    'offset' => '0',
    'scale' => '1000',
    'duration_code' => 'W'
  },
  {
    'name' => 'pm25_daily_average',
    'units' => 'ug/m3',
    'description' => 'UTC daily mean surface measured particulate matter (aerosols) 2.5 microns or smaller in diameter in micrograms per cubic meter.',
    'parameter_codes' => "'88101', '88500', '88501', '88502'",
    'offset' => '0',
    'scale' => '1',
    'duration_code' => '1'
  },
  {
    'name' => 'pm25_daily_filter',
    'units' => 'ug/m3',
    'description' => 'Local daily mean surface canister/filter-measured particulate matter (aerosols) 2.5 microns or smaller in diameter in micrograms per cubic meter.',
    'parameter_codes' => "'88101', '88500', '88501', '88502'",
    'offset' => '0',
    'scale' => '1',
    'duration_code' => '7'
  },
  {
    'name' => 'pm25',
    'units' => 'ug/m3',
    'description' => 'UTC hourly mean surface measured particulate matter (aerosols) 2.5 microns or smaller in diameter in micrograms per cubic meter.',
    'parameter_codes' => "'88101', '88500', '88501', '88502'",
    'offset' => '0',
    'scale' => '1',
    'duration_code' => '1'
  },
  {
    'name' => 'pm25_black_carbon',
    'units' => 'ug/m3',
    'description' => 'UTC hourly mean surface measured black carbon particulate matter (aerosols) 2.5 microns or smaller in diameter in micrograms per cubic meter.',
    'parameter_codes' => "'84313'",
    'offset' => '0',
    'scale' => '1',
    'duration_code' => '1'
  },
  {
    'name' => 'pm10',
    'units' => 'ug/m3',
    'description' => 'UTC hourly mean surface measured particulate matter (aerosols) 10 microns or smaller in diameter in micrograms per cubic meter.',
    'parameter_codes' => "'81102'",
    'offset' => '0',
    'scale' => '1',
    'duration_code' => '1'
  },
  {
    'name' => 'co',
    'units' => 'ppm',
    'description' => 'UTC hourly mean surface measured carbon monoxide concentration in part-per-million.',
    'parameter_codes' => "'42101'",
    'offset' => '0',
    'scale' => '1',
    'duration_code' => '1'
  },
  {
    'name' => 'so2',
    'units' => 'ppb',
    'description' => 'UTC hourly mean surface measured sulfur dioxide concentration in part-per-billion.',
    'parameter_codes' => "'42401'",
    'offset' => '0',
    'scale' => '1',
    'duration_code' => '1'
  },
  {
    'name' => 'no2',
    'units' => 'ppb',
    'description' => 'UTC hourly mean surface measured nitrogen dioxide concentration in part-per-billion.',
    'parameter_codes' => "'42602'",
    'offset' => '0',
    'scale' => '1',
    'duration_code' => '1'
  },
  {
    'name' => 'nox',
    'units' => 'ppb',
    'description' => 'UTC hourly mean surface measured mono-nitrogen oxides concentration in part-per-billion.',
    'parameter_codes' => "'42603'",
    'offset' => '0',
    'scale' => '1',
    'duration_code' => '1'
  },
  {
    'name' => 'noy',
    'units' => 'ppb',
    'description' => 'UTC hourly mean surface measured reactive odd nitrogen concentration in part-per-billion.',
    'parameter_codes' => "'42600'",
    'offset' => '0',
    'scale' => '1',
    'duration_code' => '1'
  },
  {
    'name' => 'rh',
    'units' => '%',
    'description' => 'UTC hourly mean surface measured relative humidity in percent.',
    'parameter_codes' => "'62201', '62202', '68110'",
    'offset' => '0',
    'scale' => '1',
    'duration_code' => '1'
  },
  {
    'name' => 'dew_point',
    'units' => 'C',
    'description' => 'UTC hourly mean surface measured dew point temperature in degrees celsius.',
    'parameter_codes' => "'62103'",
    'offset' => '32',
    'scale' => '0.55555555555',
    'duration_code' => '1'
  },
  {
    'name' => 'temperature',
    'units' => 'C',
    'description' => 'UTC hourly mean surface measured temperature in degrees celsius.',
    'parameter_codes' => "'62101'",
    'offset' => '32',
    'scale' => '0.55555555555',
    'duration_code' => '1'
  },
  {
    'name' => 'pressure',
    'units' => 'hPa',
    'description' => 'UTC hourly mean surface measured atmospheric pressure in hecto-Pascals.',
    'parameter_codes' => "'64101'",
    'offset' => '0',
    'scale' => '1',
    'duration_code' => '1'
  },
  {
    # https://www.wcc.nrcs.usda.gov/ftpref/wntsc/H&H/GEM/SolarRadConversion.pdf
    # Original non-SI units are Langleys/minute.
    # Langley/hour = 11.63 W/m2
    # Langley/minute * 60 minutes/hour = Langleys/hour.
    # So Langleys/minute = 60 * 11.63 = 697.8 W/m2
    'name' => 'solar_radiation',
    'units' => 'W/m2',
    'description' => 'UTC hourly mean surface measured solar radiation in Watts per square meter.',
    'parameter_codes' => "'63301'",
    'offset' => '0',
    'scale' => '697.8',
    'duration_code' => '1'
  },
  {
    'name' => 'wind_gust',
    'units' => 'm/s',
    'description' => 'UTC hourly maximum surface measured wind gust speed ' .
      'in meters per second.',
    'parameter_codes' => "'61105'", # Maximum (gust) speed (knots).
    'offset' => '0',
    'scale' => '0.5144444444', # knots to meters/second.
    'duration_code' => '1'
  },
  {
    'name' => 'wind_speed',
    'units' => 'm/s',
    'description' => 'UTC hourly mean surface measured wind speed ' .
      'in meters per second.',
    'parameter_codes' => "'61103'", # Wind speed (knots).
    'offset' => '0',
    'scale' => '0.5144444444', # knots to meters/second.
    'duration_code' => '1'
  },
  {
    'name' => 'wind_bering',
    'units' => 'bering',
    'description' => 'UTC hourly mean surface measured wind bering ' .
      'in compass bering angle degrees where wind comes from.',
    'parameter_codes' => "'61104'", # Wind direction (bering angle degrees).
    'offset' => '0',
    'scale' => '1',
    'duration_code' => '1'
  },
  {
    'name' => 'wind', # Pseudo variable 2D vector.
    'units' => 'm/s',
    'description' => 'UTC hourly mean surface measured wind resultant vector ' .
      'U-component (east) and V-component (north) in meters per second.',
    'parameter_codes' => "'61103', '61104'", # Speed (knots), Bering degrees.
    'offset' => '0',
    'scale' => '1',
    # Convert knots and bering to trig angle then compute U,V components.
    'duration_code' => '1'
  }
);



# Query string parsing routine dispatch table:

my %parsers = (
  'service'          => \&parse_service_option,
  'version'          => \&parse_version_option,
  'request'          => \&parse_request_option,
  'coverage'         => \&parse_coverage_option,
  'time'             => \&parse_time_option,
  'bbox'             => \&parse_bbox_option,
  'format'           => \&parse_format_option,
  'compress'         => \&parse_compress_option,
  'aggregate'        => \&parse_aggregate_option,
  'regrid'           => \&parse_regrid_option,
  'regrid_aggregate' => \&parse_regrid_aggregate_option,
  'lambert'          => \&parse_lambert_option,
  'stereographic'    => \&parse_stereographic_option,
  'mercator'         => \&parse_mercator_option,
  'lonlat'           => \&parse_lonlat_option,
  'ellipsoid'        => \&parse_ellipsoid_option,
  'grid'             => \&parse_grid_option,
  'levels'           => \&parse_levels_option,
  'filter_missing'   => \&parse_filter_missing_option,
  'only_codes'       => \&parse_only_codes_option
);

# Webserver content types for each output format:

my %content_types = (
  'ascii'         => 'text/plain',
  'xdr'           => 'application/octet-stream',
  'netcdf-coards' => 'application/netcdf',
  'netcdf-ioapi'  => 'application/netcdf',
  'original'      => 'application/octet-stream'
);

# Full URL path to this program:

my @pathed_program_parts = split( /\//, $0 );
my $program_name = $pathed_program_parts[ @pathed_program_parts - 1 ];
my $program = "$server_path/$program_name";


################################## VARIABLES #################################


# Parsed from the URL query string:

my $service       = ''; # wcs.
my $version       = ''; # 1.0.0.
my $request       = ''; # getcapabilities or describecoverage or getcoverage.
my $coverage      = ''; # pm25, pm25_daily_average, ozone,...
my $format        = ''; # xdr, ascii, netcdf.
my $compress      = ''; # 1 = | gzip -c otherwise don't compress (default).
my $aggregate     = ''; # none, daily_mean, daily_max, daily_max8.
my $time          = ''; # E.g., 2001-08-29t00:00:00z/2001-08-30t23:59:59z.
my $bbox          = ''; # E.g., -90,28,-80,32,0,0.
my $regrid        = ''; # E.g., nearest, mean, weighted.
my $regrid_aggregate = ''; # E.g., none, all, daily.
my $lambert       = ''; # E.g., 33,45,-97,40.
my $stereographic = ''; # E.g., -98,90,45.
my $mercator      = ''; # E.g., -98.
my $lonlat        = '';
my $ellipsoid     = ''; # E.g., 6370997,6370997.
my $grid          = ''; # E.g., 268,259,-420000,-1716000,12000,12000.
my $levels        = ''; # E.g,22,2,10000,1.0,...,0.0,9.81,287.04,50,290,100000.
my $filter_missing = ''; # 0 = output missing -9999 values (default), 1 = don't
my $only_codes    = ''; # Optional parameter codes to select. Default ('') = all

# Derived from the above parsed values:

my $starting_timestamp = 0; # yyyymmddhh, e.g., 2005082600.
my $ending_timestamp   = 0; # yyyymmddhh, e.g., 2005083000.
my $hours              = 0; # E.g., 5 days = 5 x 24 = 120.
my $command    = ''; # Complete subset command to run.
my $coverage_variable = -1;

################################## ROUTINES ##################################


main();


sub main {
  my $result = 0;

  if ( ! parse_url() ) {
    print "Content-type: text/plain; charset=iso-8859-1\n\n"; # For webserver
  } elsif ( $request eq 'getcapabilities' ) {
    print "Content-type: text/xml; charset=iso-8859-1\n\n"; # For webserver
    print_capabilities();
    $result = 1;
  } elsif ( $request eq 'describecoverage' ) {
    print "Content-type: text/xml; charset=iso-8859-1\n\n"; # For webserver
    print_coverage_description();
    $result = 1;
  } elsif ( $request eq 'getcoverage' ) {
    print "Content-type: $content_types{ $format }; charset=iso-8859-1\n\n";
    compute_time_range();

